# Кортеж с названиями месяцев на русском с годом
MONTHS = (
    "ЯНВАРЬ 2025", "ФЕВРАЛЬ 2025", "МАРТ 2025", "АПРЕЛЬ 2025", "МАЙ 2025",
    "ИЮНЬ 2025", "ИЮЛЬ 2025", "АВГУСТ 2025", "СЕНТЯБРЬ 2025", "ОКТЯБРЬ 2025",
    "НОЯБРЬ 2025", "ДЕКАБРЬ 2025")

# Словари для перевода месяцев
MONTH_EN_TO_RUS = {
    "JAN": "ЯНВАРЬ", "FEB": "ФЕВРАЛЬ", "MAR": "МАРТ", "APR": "АПРЕЛЬ",
    "MAY": "МАЙ", "JUN": "ИЮНЬ", "JUL": "ИЮЛЬ", "AUG": "АВГУСТ",
    "SEP": "СЕНТЯБРЬ", "OCT": "ОКТЯБРЬ", "NOV": "НОЯБРЬ", "DEC": "ДЕКАБРЬ"
}

MONTH_RUS_TO_NUM = {
    "ЯНВАРЬ": "01", "ФЕВРАЛЬ": "02", "МАРТ": "03", "АПРЕЛЬ": "04",
    "МАЙ": "05", "ИЮНЬ": "06", "ИЮЛЬ": "07", "АВГУСТ": "08",
    "СЕНТЯБРЬ": "09", "ОКТЯБРЬ": "10", "НОЯБРЬ": "11", "ДЕКАБРЬ": "12"
}

MONTH_NUM_TO_EN = {
    "01": "JAN", "02": "FEB", "03": "MAR", "04": "APR",
    "05": "MAY", "06": "JUN", "07": "JUL", "08": "AUG",
    "09": "SEP", "10": "OCT", "11": "NOV", "12": "DEC"
}